gp2gp-translator/src/test/resources/xml/COPCMessageHandler/inbound_message_ebxml_fragment_index_with_cid.xml

<SOAP:Envelope xmlns:xsi="http://www.w3c.org/2001/XML-Schema-Instance" xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd" xmlns:hl7ebxml="urn:hl7-org:transport/ebxml/DSTUv1.0" xmlns:xlink="http://www.w3.org/1999/xlink">
    <SOAP:Header>
        <eb:MessageHeader SOAP:mustUnderstand="1" eb:version="2.0">
            <eb:From>
                <eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">RHM-801710</eb:PartyId>
            </eb:From>
            <eb:To>
                <eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">RHM-803229</eb:PartyId>
            </eb:To>
            <eb:CPAId>S2030731A2137927</eb:CPAId>
            <eb:ConversationId>74799658-43DF-11E3-805D-BBA66E7A9031</eb:ConversationId>
            <eb:Service>urn:nhs:names:services:gp2gp</eb:Service>
            <eb:Action>COPC_IN000001UK01</eb:Action>
            <eb:MessageData>
                <eb:MessageId>CBBAE92D-C7E8-4A9C-8887-F5AEBA1F8CE1</eb:MessageId>
                <eb:Timestamp>2013-11-04T14:32:28Z</eb:Timestamp>
            </eb:MessageData>
            <eb:DuplicateElimination/>
        </eb:MessageHeader>
        <eb:AckRequested SOAP:mustUnderstand="1" eb:version="2.0" eb:signed="false" SOAP:actor="urn:oasis:names:tc:ebxml-msg:actor:nextMSH"/>

    </SOAP:Header>
    <SOAP:Body>
        <eb:Manifest SOAP:mustUnderstand="1" eb:version="2.0">
            <eb:Reference xlink:href="cid:ee1ba199-455d-11e3-bbe2-e36892d8683a@spine.nhs.uk">
                <eb:Schema eb:location="http://www.nhsia.nhs.uk/schemas/HL7-Message.xsd" eb:version="1.0"/>
                <eb:Description xml:lang="en">HL7 payload</eb:Description>
                <hl7ebxml:Payload style="HL7" encoding="XML" version="3.0"/>
            </eb:Reference>
            <eb:Reference xlink:href="cid:435B1171-31F6-4EF2-AD7F-C7E64EEFF357">
                <eb:Description xml:lang="en">
                    Filename="CBBAE92D-C7E8-4A9C-8887-F5AEBA1F8CE1_0.messageattachment"
                    ContentType=application/x-gzip
                    Compressed=No
                    LargeAttachment=No
                    OriginalBase64=Yes
                </eb:Description>
            </eb:Reference>
            <eb:Reference xlink:href="mid:047C22B4-613F-47D3-9A72-44A1758464FB">
                <eb:Description xml:lang="en">
                    Filename="CBBAE92D-C7E8-4A9C-8887-F5AEBA1F8CE1_1.messageattachment"
                    ContentType=application/x-gzip
                    Compressed=No
                    LargeAttachment=No
                    OriginalBase64=Yes
                </eb:Description>
            </eb:Reference>
            <eb:Reference xlink:href="mid:095DF934-2804-4BE6-B15C-936A60E940CD">
                <eb:Description xml:lang="en">
                    Filename="CBBAE92D-C7E8-4A9C-8887-F5AEBA1F8CE1_2.messageattachment"
                    ContentType=application/x-gzip
                    Compressed=No
                    LargeAttachment=No
                    OriginalBase64=Yes
                </eb:Description>
            </eb:Reference>
        </eb:Manifest>
    </SOAP:Body>
</SOAP:Envelope>